Catalogs/ИндивидуальныйПланРазвития.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИндивидуальныйПланРазвития</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекомендацииРазвития</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КадровыйРезерв</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыИндивидуальныхПлановРазвития</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьНаставник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьКуратор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наставник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникПроцессаНаставничества</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Куратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаключениеНаставника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаключениеКуратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПрогрессРазвития</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродолжительностьПрогрессаРазвития</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерностьПродолжительностиПрогрессаРазвития</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрогрессВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкорректированныйИПР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИндивидуальныйПланРазвития</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДействияСотрудников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДействиеСотрудника</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДействияСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Мероприятия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Мероприятие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МероприятияОбученияРазвития</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатВыполнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦелиРазвития</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьВидМероприятия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыМероприятияОбученияРазвития</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обучение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыбранноеОбучение</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОбучениеРазвитиеСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РазвиваемыеХарактеристики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗначенияХарактеристик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяОбучение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьЗначение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ХарактеристикиПерсонала</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ХарактеристикиСотрудника</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗначенияХарактеристик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БаллХарактеристики</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьЗначение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ХарактеристикиПерсонала</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЦелиРазвития</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Цель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦелиРазвития</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьРазвивающиеДействия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРазвивающихДействий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УдалитьВидыРазвивающихДействий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазвивающееДействие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатВыполнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/НазначенияКадровогоРезерва.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>НазначенияКадровогоРезерва</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПозицияШтатногоРасписания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГруппаКадровогоРезерва</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КатегорияГруппаДолжностей</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЦелиРазвития.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЦелиРазвития</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Характеристики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МероприятияОбучения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Мероприятие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МероприятияОбученияРазвития</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИндивидуальныйПланРазвития/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Владелец)
	|	И ЗначениеРазрешено(Подразделение)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗаполнитьСтатусы");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляПодчиненногоСправочника(Настройки, "УправленческиеДанные");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиОбновления

// Выполняет заполенени реквизита Статус в индивидуальных планах развития при обновлении.
// 
// Параметры:
//  ПараметрыОбновления - Структура
Процедура ЗаполнитьСтатусы(ПараметрыОбновления = Неопределено) Экспорт
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
		"ОбработкаЗавершена", Ложь);
	
	Если Не ПараметрыОбновления.Свойство("ОбработанныеЭлементы") Тогда
		ПараметрыОбновления.Вставить("ОбработанныеЭлементы", Новый Массив);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбработанныеЭлементы", ПараметрыОбновления.ОбработанныеЭлементы);
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ИндивидуальныйПланРазвития.Ссылка КАК Ссылка,
		|	ИндивидуальныйПланРазвития.ПометкаУдаления,
		|	ИндивидуальныйПланРазвития.ДатаНачала,
		|	ИндивидуальныйПланРазвития.ДатаОкончания
		|ИЗ
		|	Справочник.ИндивидуальныйПланРазвития КАК ИндивидуальныйПланРазвития
		|ГДЕ
		|	НЕ ИндивидуальныйПланРазвития.Ссылка В (&ОбработанныеЭлементы)
		|	И ИндивидуальныйПланРазвития.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыИндивидуальныхПлановРазвития.ПустаяСсылка)";
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(Метаданные.Справочники.ИндивидуальныйПланРазвития.ПолноеИмя());
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	Сегодня = НачалоДня(ТекущаяДатаСеанса());
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
				"ОбработкаЗавершена", Истина);
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
				"ОбработанныеЭлементы", Новый Массив);
			ЗафиксироватьТранзакцию();
			Возврат;
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект(); // СправочникОбъект.ИндивидуальныйПланРазвития
			Если Выборка.ПометкаУдаления Тогда
				Статус = Справочники.СтатусыИндивидуальныхПлановРазвития.Отклонен;
			ИначеЕсли Выборка.ДатаОкончания < Сегодня Тогда
				Статус = Справочники.СтатусыИндивидуальныхПлановРазвития.Завершен;
			Иначе
				Статус = Справочники.СтатусыИндивидуальныхПлановРазвития.НаРассмотрении;
			КонецЕсли;
			СправочникОбъект.Статус = Статус;
			
			// Так как значение статуса зависит от даты обновления базы, то статусы в подчиненных узлах РИБ нужно
			// актуализировать из главного узла.
			// В тех планах развития, которых нет в главном узле, статус будет заполнен в подчиненных узлах самостоятельно.
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект, Не ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ());
			
			ПараметрыОбновления.ОбработанныеЭлементы.Добавить(Выборка.Ссылка);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Ученический договор
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Справочник.ИндивидуальныйПланРазвития";
	КомандаПечати.Идентификатор = "ИндивидуальныйПланРазвития";
	КомандаПечати.Представление = НСтр("ru = 'Индивидуальный план развития'");
	КомандаПечати.Порядок = 1;
	
	// Выполнение плана развития
	ИспользоватьЦелиРазвитияСотрудников = ПолучитьФункциональнуюОпцию("ИспользоватьЦелиРазвитияСотрудников");
	Если ИспользоватьЦелиРазвитияСотрудников Тогда
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
		КомандаПечати.МенеджерПечати = "Справочник.ИндивидуальныйПланРазвития";
		КомандаПечати.Идентификатор = "ИндивидуальныйПланРазвитияПоЦелям";
		КомандаПечати.Представление = НСтр("ru = 'Индивидуальный план развития по целям'");
		КомандаПечати.Порядок = 2;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") Тогда
		МодульГосударственнаяСлужба = ОбщегоНазначения.ОбщийМодуль("ГосударственнаяСлужба");
		МодульГосударственнаяСлужба.ДобавитьКомандуПечатиПланаМероприятийГосслужащих(КомандыПечати);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") Тогда
		МодульГосударственнаяСлужба = ОбщегоНазначения.ОбщийМодуль("ГосударственнаяСлужба");
		МодульГосударственнаяСлужба.ДобавитьКомандуПечатиОтзываОРезультатахНаставничестваГосслужащих(КомандыПечати);
	КонецЕсли;
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ИндивидуальныйПланРазвития");
	Если НужноПечататьМакет Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ИндивидуальныйПланРазвития",
			НСтр("ru = 'Индивидуальный план развития'"),
			ПечатьИПР(МассивОбъектов, ОбъектыПечати),
			,
			"Справочник.ИндивидуальныйПланРазвития.ПФ_MXL_ИндивидуальныйПланРазвития");
	КонецЕсли;
		
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ИндивидуальныйПланРазвитияПоЦелям");
	Если НужноПечататьМакет Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ИндивидуальныйПланРазвитияПоЦелям",
			НСтр("ru = 'Индивидуальный план развития по целям'"),
			ПечатьИПРПоЦелям(МассивОбъектов, ОбъектыПечати),
			,
			"Справочник.ИндивидуальныйПланРазвития.ПФ_MXL_ИндивидуальныйПланРазвитияПоЦелям");
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьИПР(МассивОбъектов, ОбъектыПечати)
	
	// Создаем табличный документ и устанавливаем имя параметров печати.
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ИПР";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.ИндивидуальныйПланРазвития.ПФ_MXL_ИндивидуальныйПланРазвития");
	
	Области = Новый Структура();
	Области.Вставить("Шапка", Макет.ПолучитьОбласть("Шапка"));
	Области.Вставить("Строка", Макет.ПолучитьОбласть("СтрокаМероприятия"));
	
	ПоляПоискаРезультатов = "ФизическоеЛицо, Мероприятие, ДатаНачалаПлан, ДатаОкончанияПлан";
	ОтборРезультатов = Новый Структура(ПоляПоискаРезультатов);
	
	ДанныеДляПечати = ДанныеДляПечати(МассивОбъектов);
	Если ДанныеДляПечати.РезультатыОбучения <> Неопределено Тогда
		ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ДанныеДляПечати.РезультатыОбучения, ПоляПоискаРезультатов);
	КонецЕсли;
	
	Обход = Обработки.ОбходКоллекции.НовыйОбход(ДанныеДляПечати.ИндивидуальныеПланыРазвития);
	Пока Обход.СледующийПоЗначениюПоля("ИндивидуальныйПланРазвития") Цикл
		ЗаполнитьЗначенияСвойств(Области.Шапка.Параметры, Обход.ТекущиеДанные());
		Области.Шапка.Параметры.ДатаНачалаИПР = Формат(Обход.ТекущиеДанные().ДатаНачалаИПР, "ДЛФ=D");
		Области.Шапка.Параметры.ДатаОкончанияИПР = Формат(Обход.ТекущиеДанные().ДатаОкончанияИПР, "ДЛФ=D");
		ТабличныйДокумент.Вывести(Области.Шапка);
		Пока Обход.СледующийПоЗначениямПолей("НомерСтроки") Цикл
			ЗаполнитьЗначенияСвойств(Области.Строка.Параметры, Обход.ТекущиеДанные());
			Области.Строка.Параметры.ДатаНачала = Формат(Обход.ТекущиеДанные().ДатаНачала, "ДЛФ=D");
			Области.Строка.Параметры.ДатаОкончания = Формат(Обход.ТекущиеДанные().ДатаОкончания, "ДЛФ=D");
			Области.Строка.Параметры.ФамилияИООтветственного = ФизическиеЛицаЗарплатаКадрыКлиентСервер.ФамилияИнициалы(
				Обход.ТекущиеДанные().ФИООтветственного);
			ПредставлениеРезультатов = "";
			Если ДанныеДляПечати.РезультатыОбучения <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ОтборРезультатов, Обход.ТекущиеДанные());
				ОтборРезультатов.ДатаНачалаПлан = Обход.ТекущиеДанные().ДатаНачала;
				ОтборРезультатов.ДатаОкончанияПлан = Обход.ТекущиеДанные().ДатаОкончания;
				РезультатыОбучения = ДанныеДляПечати.РезультатыОбучения.НайтиСтроки(ОтборРезультатов);
				ДополнитьПредставление(ПредставлениеРезультатов, 
					ОбучениеРазвитиеКлиентСервер.ПредставлениеРезультатовОбучения(РезультатыОбучения));
			КонецЕсли;
			ДополнитьПредставление(ПредставлениеРезультатов, Обход.ТекущиеДанные().РезультатВыполнения, Символы.ПС);
			Области.Строка.Параметры.Результаты = ПредставлениеРезультатов;
			ТабличныйДокумент.Вывести(Области.Строка);
		КонецЦикла;
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьИПРПоЦелям(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ИПР";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.ИндивидуальныйПланРазвития.ПФ_MXL_ИндивидуальныйПланРазвитияПоЦелям");
	
	Области = Новый Структура();
	Области.Вставить("Шапка", Макет.ПолучитьОбласть("Шапка"));
	Области.Вставить("ШапкаОпросы", Макет.ПолучитьОбласть("ШапкаОпросы"));
	Области.Вставить("Опросы", Макет.ПолучитьОбласть("Опросы"));
	Области.Вставить("Рекомендации", Макет.ПолучитьОбласть("Рекомендации"));
	Области.Вставить("ШапкаМероприятия", Макет.ПолучитьОбласть("ШапкаМероприятия"));
	Области.Вставить("Мероприятия", Макет.ПолучитьОбласть("Мероприятия"));
	Области.Вставить("Подвал", Макет.ПолучитьОбласть("Подвал"));
	
	ПоляПоискаРезультатов = "ФизическоеЛицо, Мероприятие, ДатаНачалаПлан, ДатаОкончанияПлан";
	
	ДанныеДляПечати = ДанныеДляПечати(МассивОбъектов);
	Если ДанныеДляПечати.РезультатыОбучения <> Неопределено Тогда
		ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ДанныеДляПечати.РезультатыОбучения, ПоляПоискаРезультатов);
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	Оцениваемые = ДанныеДляПечати.ИндивидуальныеПланыРазвития.ВыгрузитьКолонку("ФизическоеЛицо");
	
	РезультатыЭкспертнойОценки = ЭкспертнаяОценкаПерсонала.РезультатыЭкспертнойОценки(Оцениваемые);
	
	Цели = ДанныеДляПечати.ИндивидуальныеПланыРазвития.ВыгрузитьКолонку("ЦельРазвития");
	Мероприятия = ДанныеДляПечати.ИндивидуальныеПланыРазвития.ВыгрузитьКолонку("Мероприятие");
	ХарактеристикиМероприятий = ХарактеристикиМероприятия(Цели, Мероприятия);
	ХарактеристикиИПР = ХарактеристикиИПР(
		ДанныеДляПечати.ИндивидуальныеПланыРазвития.ВыгрузитьКолонку("ИндивидуальныйПланРазвития"));
	
	Обход = Обработки.ОбходКоллекции.НовыйОбход(ДанныеДляПечати.ИндивидуальныеПланыРазвития);
	Пока Обход.СледующийПоЗначениюПоля("ИндивидуальныйПланРазвития") Цикл
		ТекущиеДанные = Обход.ТекущиеДанные();
		ЗаполнитьЗначенияСвойств(Области.Шапка.Параметры, ТекущиеДанные);
		Области.Шапка.Параметры.ДатаНачалаИПР = Формат(ТекущиеДанные.ДатаНачалаИПР, "ДЛФ=D");
		Области.Шапка.Параметры.ДатаОкончанияИПР = Формат(ТекущиеДанные.ДатаОкончанияИПР, "ДЛФ=D");
		
		СотрудникиФизическихЛиц = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТекущиеДанные.ФизическоеЛицо),
			Истина,
			ОрганизацияИПР(ТекущиеДанные.Подразделение),
			ТекущаяДата);
		
		Если СотрудникиФизическихЛиц.Количество() > 0 Тогда
			СтрокаСотрудника = СотрудникиФизическихЛиц.Найти(ТекущиеДанные.ФизическоеЛицо, "ФизическоеЛицо");
			Если СтрокаСотрудника <> Неопределено Тогда
				Области.Шапка.Параметры.Организация = СтрокаСотрудника.ГоловнаяОрганизация;
				Области.Шапка.Параметры.Должность = КадровыйУчет.КадровыеДанныеСотрудника(
					Истина, СтрокаСотрудника.Сотрудник, "Должность", ТекущаяДата).Должность;
			КонецЕсли;
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(Области.Шапка);
		
		ТабличныйДокумент.Вывести(Области.ШапкаОпросы);
		
		ПрофильОценки = ПрофильДолжностиПозицииРезерва(ТекущиеДанные.ПозицияКР);
		Если ЗначениеЗаполнено(ПрофильОценки) Тогда
			РезультатыОценки = РезультатыЭкспертнойОценки.НайтиСтроки(
				Новый Структура("ФизическоеЛицо, ПрофильДолжности", ТекущиеДанные.ФизическоеЛицо, ПрофильОценки));
			Если РезультатыОценки.Количество() <> 0 Тогда
				ДанныеОценки = РезультатыОценки[0];
				Области.Опросы.Параметры.ОпросыПоКомпетенциям =
					СтрШаблон(НСтр("ru = '%1 - %2'"),
					ДанныеОценки.ОпросПоКомпетенциям,
					Формат(ДанныеОценки.Оценка, "ЧДЦ=2;"));
			КонецЕсли;
		КонецЕсли;
		ТабличныйДокумент.Вывести(Области.Опросы);
		
		Области.Рекомендации.Параметры.РекомендацииРазвития = ТекущиеДанные.РекомендацииРазвития;
		ТабличныйДокумент.Вывести(Области.Рекомендации);
		
		ТабличныйДокумент.Вывести(Области.ШапкаМероприятия);
		Пока Обход.СледующийПоЗначениямПолей("НомерСтроки") Цикл
			ХарактеристикиМероприятияИПР = Новый Массив;
			ТекущиеДанные = Обход.ТекущиеДанные();
			ЗаполнитьЗначенияСвойств(Области.Мероприятия.Параметры, ТекущиеДанные);
			Области.Мероприятия.Параметры.ДатаНачала = Формат(ТекущиеДанные.ДатаНачала, "ДЛФ=D");
			Области.Мероприятия.Параметры.ДатаОкончания = Формат(ТекущиеДанные.ДатаОкончания, "ДЛФ=D");
			Области.Мероприятия.Параметры.ФормаОбучения = ТекущиеДанные.ВидМероприятия;
			Области.Мероприятия.Параметры.ФамилияИООтветственного =
				ФизическиеЛицаЗарплатаКадрыКлиентСервер.ФамилияИнициалы(ТекущиеДанные.ФИООтветственного);
			Характеристики = ХарактеристикиИПР.НайтиСтроки(Новый Структура("ИндивидуальныйПланРазвития",
				ТекущиеДанные.ИндивидуальныйПланРазвития));
			ХарактеристикиМероприятия = ХарактеристикиМероприятий.НайтиСтроки(Новый Структура("Цель, Мероприятие",
				ТекущиеДанные.ЦельРазвития, ТекущиеДанные.Мероприятие));
			Для Каждого ХарактеристикаМероприятия Из ХарактеристикиМероприятия Цикл
				Для Каждого Характеристика Из Характеристики Цикл
					Если ХарактеристикаМероприятия.Характеристика = Характеристика.Характеристика Тогда
						ХарактеристикиМероприятияИПР.Добавить(ХарактеристикаМероприятия.Характеристика);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			Области.Мероприятия.Параметры.Характеристики = СтрСоединить(ХарактеристикиМероприятияИПР, ", ");
			ТабличныйДокумент.Вывести(Области.Мероприятия);
		КонецЦикла;
		
		ЗаполнитьЗначенияСвойств(Области.Подвал.Параметры, ТекущиеДанные);
		Области.Подвал.Параметры.ПозицияСотрудника = КадровыйУчет.КадровыеДанныеСотрудника(
			Истина, СтрокаСотрудника.Сотрудник, "ДолжностьПоШтатномуРасписанию", ТекущаяДата).ДолжностьПоШтатномуРасписанию;
		
		Если ЗначениеЗаполнено(ТекущиеДанные.Куратор) Тогда
			Области.Подвал.Параметры.ФИОКуратора = ТекущиеДанные.Куратор.ФИО;
		Иначе
			Области.Подвал.Параметры.ФИОКуратора = Неопределено;
		КонецЕсли;
		
		СотрудникиФизическихЛиц = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТекущиеДанные.ФизическоеЛицо),
			Истина,
			Справочники.Организации.ОрганизацияПоУмолчанию(),
			ТекущаяДата);
		
		Если СотрудникиФизическихЛиц.Количество() > 0 Тогда
			СтрокаСотрудника = СотрудникиФизическихЛиц.Найти(ТекущиеДанные.Куратор, "ФизическоеЛицо");
			Если СтрокаСотрудника <> Неопределено Тогда
				Области.Подвал.Параметры.ПозицияКуратора = КадровыйУчет.КадровыеДанныеСотрудника(
					Истина, СтрокаСотрудника.Сотрудник, "ДолжностьПоШтатномуРасписанию", ТекущаяДата).ДолжностьПоШтатномуРасписанию;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекущиеДанные.Наставник) Тогда
			Области.Подвал.Параметры.ФИОНаставника = ТекущиеДанные.Наставник.ФИО;
		Иначе
			Области.Подвал.Параметры.ФИОНаставника = Неопределено;
		КонецЕсли;
	
		СотрудникиФизическихЛиц = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТекущиеДанные.ФизическоеЛицо),
			Истина,
			Справочники.Организации.ОрганизацияПоУмолчанию(),
			ТекущаяДата);
		
		Если СотрудникиФизическихЛиц.Количество() > 0 Тогда
			СтрокаСотрудника = СотрудникиФизическихЛиц.Найти(ТекущиеДанные.Наставник, "ФизическоеЛицо");
			Если СтрокаСотрудника <> Неопределено Тогда
				Области.Подвал.Параметры.ПозицияНаставника = КадровыйУчет.КадровыеДанныеСотрудника(
					Истина, СтрокаСотрудника.Сотрудник, "ДолжностьПоШтатномуРасписанию", ТекущаяДата).ДолжностьПоШтатномуРасписанию;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекущиеДанные.ОтветственныйФЛ) Тогда
			Области.Подвал.Параметры.ФИООтветственногоИПР = ТекущиеДанные.ОтветственныйФЛ.ФИО;
		КонецЕсли;
		ТабличныйДокумент.Вывести(Области.Подвал);
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ДанныеДляПечати(ИндивидуальныеПланыРазвития) Экспорт
	
	Данные = Новый Структура();
	Данные.Вставить("ИндивидуальныеПланыРазвития");
	Данные.Вставить("РезультатыОбучения");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИндивидуальныеПланыРазвития", ИндивидуальныеПланыРазвития);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИндивидуальныйПланРазвития.Ссылка КАК ИндивидуальныйПланРазвития,
		|	ИндивидуальныйПланРазвития.Владелец КАК ФизическоеЛицо,
		|	ИндивидуальныйПланРазвития.Владелец.ФИО КАК ФИОСотрудника,
		|	ИндивидуальныйПланРазвития.Ответственный.ФизическоеЛицо КАК СотрудникКадровойСлужбы,
		|	ИндивидуальныйПланРазвития.Ответственный.ФизическоеЛицо.ФИО КАК ФИОСотрудникаКадровойСлужбы,
		|	ИндивидуальныйПланРазвития.ДатаНачала КАК ДатаНачалаИПР,
		|	ИндивидуальныйПланРазвития.ДатаОкончания КАК ДатаОкончанияИПР,
		|	ИндивидуальныйПланРазвития.Подразделение КАК Подразделение,
		|	ИндивидуальныйПланРазвития.РекомендацииРазвития КАК РекомендацииРазвития,
		|	ИндивидуальныйПланРазвития.Основание КАК ПозицияКР,
		|	ИндивидуальныйПланРазвития.Наставник КАК Наставник,
		|	ИндивидуальныйПланРазвития.Куратор КАК Куратор,
		|	ИндивидуальныйПланРазвития.Ответственный.ФизическоеЛицо КАК ОтветственныйФЛ,
		|	ПрограммаОбучения.Мероприятие КАК Мероприятие,
		|	ПрограммаОбучения.ДатаНачала КАК ДатаНачала,
		|	ПрограммаОбучения.ДатаОкончания КАК ДатаОкончания,
		|	ПрограммаОбучения.РезультатВыполнения КАК РезультатВыполнения,
		|	ПрограммаОбучения.Ответственный КАК Ответственный,
		|	ПрограммаОбучения.Мероприятие.ВидМероприятия КАК ВидМероприятия,
		|	ПрограммаОбучения.НомерСтроки КАК НомерСтроки,
		|	ПрограммаОбучения.ВыбранноеОбучение КАК ВыбранноеОбучение,
		|	ПрограммаОбучения.Цель КАК ЦельРазвития,
		|	ЕСТЬNULL(ПрограммаОбучения.Ответственный.ФИО, """") КАК ФИООтветственного
		|ИЗ
		|	Справочник.ИндивидуальныйПланРазвития КАК ИндивидуальныйПланРазвития
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИндивидуальныйПланРазвития.Мероприятия КАК ПрограммаОбучения
		|		ПО (ПрограммаОбучения.Ссылка = ИндивидуальныйПланРазвития.Ссылка)
		|ГДЕ
		|	ИндивидуальныйПланРазвития.Ссылка В(&ИндивидуальныеПланыРазвития)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИндивидуальныйПланРазвития,
		|	НомерСтроки";
	Данные.ИндивидуальныеПланыРазвития = Запрос.Выполнить().Выгрузить();
	
	Если ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ОбучениеСотрудников) Тогда
		Данные.РезультатыОбучения = ОбучениеРазвитие.РезультатыОбучения(
			Данные.ИндивидуальныеПланыРазвития.Скопировать(, 
				СтрСоединить(ОбщегоНазначения.ВыгрузитьКолонку(ОбучениеРазвитие.НовыйПланМероприятий().Колонки, "Имя"), ",")));
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

Функция ХарактеристикиИПР(ИндивидуальныеПланыРазвития)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИндивидуальныеПланыРазвития", ИндивидуальныеПланыРазвития);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИндивидуальныйПланРазвития.Ссылка КАК ИндивидуальныйПланРазвития,
		|	Характеристики.Характеристика КАК Характеристика
		|ИЗ
		|	Справочник.ИндивидуальныйПланРазвития КАК ИндивидуальныйПланРазвития
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИндивидуальныйПланРазвития.РазвиваемыеХарактеристики КАК Характеристики
		|		ПО (Характеристики.Ссылка = ИндивидуальныйПланРазвития.Ссылка)
		|			И (Характеристики.ТребуетсяОбучение)
		|ГДЕ
		|	ИндивидуальныйПланРазвития.Ссылка В(&ИндивидуальныеПланыРазвития)
		|
		|СГРУППИРОВАТЬ ПО
		|	Характеристики.Характеристика,
		|	ИндивидуальныйПланРазвития.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИндивидуальныйПланРазвития";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ХарактеристикиМероприятия(Цели, Мероприятия)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Цели", Цели);
	Запрос.УстановитьПараметр("Мероприятия", Мероприятия);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦелиРазвития.Ссылка КАК Цель,
		|	ЦелиРазвитияМероприятияОбучения.Мероприятие КАК Мероприятие,
		|	ЦелиРазвитияМероприятияОбучения.Характеристика КАК Характеристика
		|ИЗ
		|	Справочник.ЦелиРазвития КАК ЦелиРазвития
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦелиРазвития.МероприятияОбучения КАК ЦелиРазвитияМероприятияОбучения
		|		ПО ЦелиРазвития.Ссылка = ЦелиРазвитияМероприятияОбучения.Ссылка
		|		И ЦелиРазвитияМероприятияОбучения.Мероприятие В (&Мероприятия)
		|ГДЕ
		|	ЦелиРазвития.Ссылка В (&Цели)";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ДополнитьПредставление(Представление, Дополнение, Разделитель = ", ") Экспорт
	ОбучениеРазвитиеКлиентСервер.ДополнитьПредставление(Представление, Дополнение, Разделитель);
КонецПроцедуры

Функция ПрофильДолжностиПозицииРезерва(ПозицияКадровогоРезерва)
	
	Если ПозицияКадровогоРезерва.Назначение = Перечисления.НазначенияКадровогоРезерва.ГруппаКадровогоРезерва Тогда
		Возврат ПозицияКадровогоРезерва.ПрофильДолжности;
	Иначе
		ПрофильДолжностиМассив = ХарактеристикиПерсонала.ПрофильДолжностиПоПозицииШтатногоРасписания(ПозицияКадровогоРезерва.ПозицияШтатногоРасписания);
		Если ПрофильДолжностиМассив.Количество() > 0 Тогда
			Возврат ПрофильДолжностиМассив[0];
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция ОрганизацияИПР(Подразделение)
	
	Источник = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Подразделение, "Источник");
	Если ТипЗнч(Источник) = Тип("СправочникСсылка.Организации") Тогда
		ОрганизацияИПР = Источник;
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
		ОрганизацияИПР = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник, "ГоловнаяОрганизация");
	Иначе
		ОрганизацияИПР = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ОрганизацияИПР;
	
КонецФункции

#КонецОбласти

#КонецЕсли
